[
  {
    "Id": "65814",
    "ThreadId": "19866",
    "Html": "\r\nHi Jonathan,<br />First of all - thanks for a great graph library. It could certainly save us some work, and would certainly be a lot better than we could have done! <br />However... just a couple of comments...<br />First, though I know you work for Microsoft, in the open source world it is pretty annoying when it is either impossible or hard to compile from source. Sure, just remove the tests, but having Pex would be a lot nicer. <b>Is</b> it downloadable anywhere?<br />Second, I saw another discussion on the licence, and the person is completely right - it's half a licence. I would like to recommend that you add the necessary \"sugar\". Basically the MIT http://www.opensource.org/licenses/mit-license.php or the BSD http://www.opensource.org/licenses/bsd-license.php seem to do what you want. I'm not an expert, but I think that the person was right when they said that, in fact, nobody but YOU has the right to use the software at all - not even your employer Microsoft!<br />I'm pretty sure this would take you about 5 minutes, and we won't be able to use it otherwise (and if I'm right nobody else either!)...<br />Thanks for the great work,<br />Anton<br />",
    "PostedDate": "2008-01-03T00:11:55.89-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "66256",
    "ThreadId": "19866",
    "Html": "\r\nI've updated the license to MS-pl. Thanks for reminding me this.<br />I've also removed the Pex bindings, it should build smoothly now.<br />",
    "PostedDate": "2008-01-05T09:37:11.853-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "66342",
    "ThreadId": "19866",
    "Html": "\r\nThanks! And good choice on the license. Keeping it MS makes lots of sense!<br />And any idea when we might get a look at Pex? It looks very interesting and even if it does go nowhere it would be nice to have a look at... is it up to you or the bosses?<br />",
    "PostedDate": "2008-01-06T01:44:47.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "66351",
    "ThreadId": "19866",
    "Html": "\r\nUnfortunately, it's not up to me to decide when Pex will get out of the door :)<br />",
    "PostedDate": "2008-01-06T03:06:16.727-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  }
]