[
  {
    "Id": "137202",
    "ThreadId": "41363",
    "Html": "Hi everybody,<br>\r\n<br>\r\nI need to know the minimum cut in an undirected graph.<br>\r\nThe maximum flow algorithms all work with directed graphs only - is there any way other than converting my graph to a directed one with double edges?<br>\r\n<br>\r\nThanks for any help,<br>\r\n<br>\r\nHendrik.<br>\r\n<br>\r\nP.S.: Even more useful would be some kind of partitioning algorithm that divides the graph into two equally sized parts and minimizes edges between them - but I guess that's not included in QuickGraph, is it..?<br>\r\n",
    "PostedDate": "2008-12-03T02:50:30.507-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "137220",
    "ThreadId": "41363",
    "Html": "I am also very interest in partitioning.<br>\r\n<br>\r\nI googled about this for hours, and without the &quot;CustomizeGoogle&quot; addin for FireFox I would have went insane..<br>\r\nNothing but links to Cites, and patents.  Must have blocked about 100 sites from googles result list.<br>\r\n<br>\r\nAnyway, there are a few packages available.  All large, complex, and C/C++.  I did not have much interest..<br>\r\nSome discussion of theory, but few algorithms available.<br>\r\n<br>\r\nThis seems to be used a lot in finite element analysis, and social networking sites.<br>\r\n<br>\r\nBasically, it is an incredibly difficult problem domain.<br>\r\n<br>\r\nWhat is your underlying data set based upon?\r\n",
    "PostedDate": "2008-12-03T04:49:37.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "231132",
    "ThreadId": "41363",
    "Html": "<p>hello you can use a reversedEdgeAugmentorAlgorithm and set&nbsp;their value to 0 like&nbsp;at <a href=\"http://quickgraph.codeplex.com/Thread/View.aspx?ThreadId=59583\">http://quickgraph.codeplex.com/Thread/View.aspx?ThreadId=59583</a>. But i am interested about how you can apply the minimum cut on the maximum flow. Is there a sample of code that do it, or should i just use the residualcapacities graph and apply a&nbsp;connection algorith&nbsp;on it ?&nbsp;</p>\r\n<p>thz in advance</p>",
    "PostedDate": "2009-09-04T06:57:26.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]