[
  {
    "Id": "250113",
    "ThreadId": "73201",
    "Html": "<p>Hi,</p>\r\n<p>I am new in QuickGraph i got a task to implement Shortest Path Algorithm. I search the net for code help but i did not found anything.</p>\r\n<p>I really do not know how QuickGraph work I need to calculate Shortest path from SHP file.</p>\r\n<p>I really be grateful if any one help me.</p>\r\n<p>Thanks in advance...</p>",
    "PostedDate": "2009-10-27T03:33:06.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251051",
    "ThreadId": "73201",
    "Html": "<p>Please Help !!!!!</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-28T23:42:12.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "251333",
    "ThreadId": "73201",
    "Html": "<p>&nbsp; Dear barman,</p>\r\n<p>You do not provide a very exact description of your problem.</p>\r\n<p>I have Googled for the term &quot;SHP file&quot; and found several different meanings.</p>\r\n<p>Apparently it is a file format for geographical data (maps).</p>\r\n<p>QuickGraph does not support such a file format.</p>\r\n<p>It does contain a shortest path algorithm that may be useful to you.</p>\r\n<p>You'd have to write code to import an SHP file.</p>\r\n<p>What makes you think using QuickGraph is a good approach to your problem?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-29T12:37:33.26-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "261455",
    "ThreadId": "73201",
    "Html": "<p>Hi barman,&nbsp; as rp mentionned, please provide a link that describes the SHP file format.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-28T17:50:20.34-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "274978",
    "ThreadId": "73201",
    "Html": "<p>Hello barman,</p>\r\n<p>i had similar thing to do in the past and i have implement it with Quickgraph, a very simple way to manage your shapefile&nbsp;is to&nbsp;insert it in&nbsp;a spatial database (so youll keep all the geometry and youll be able to do operation on them later if needed), Then just use the database entries to initialize you dijkstra algorith. The advantage of doing this is probably that all operations that youll do on geometry will be lot easier and also youll be able to add/correct/specialize/update the shapefile as you want. Be sure to keep your sql script or dump that generate your database from the shapefile since it is very usefull when they update the data. If you dont see the utilities of the spatial database youll change your mind when youll have to compute the weight of the edge, reverse edge geometry or do operation on them.</p>\r\n<p>these a lot of database that got spatial database, as a free example PostGis&nbsp;can be use as spatial module of PostGre.</p>\r\n<p>have a nice day</p>",
    "PostedDate": "2010-01-08T14:30:42.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "276962",
    "ThreadId": "73201",
    "Html": "<p><span style=\"font-size:11pt;color:navy\">Hi graphTest,</span></p>\r\n<p><span style=\"font-size:11pt;color:navy\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Thank you for your response. You are right this problem can easily handle with Spatial Database but my requirement is to do the job with SHP files I can not use the spatial database.</span></p>\r\n<p><span style=\"font-size:11pt;color:navy\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Now present status is the shortest path is implemented using SHP files. But now I am stuck in serialization problem the detail is posted in the discussion forum with a sample file below is the link.</span></p>\r\n<p><span style=\"font-size:11pt;color:navy\">Link:&nbsp;&nbsp;&nbsp;&nbsp; <a href=\"../WorkItem/View.aspx?WorkItemId=15504\">http://quickgraph.codeplex.com/WorkItem/View.aspx?WorkItemId=15504</a></span></p>\r\n<p><span style=\"font-size:11pt;color:navy\">Thanks you again and I am awaiting for your response.</span></p>",
    "PostedDate": "2010-01-13T20:43:56.33-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]