[
  {
    "Id": "435786",
    "ThreadId": "210644",
    "Html": "<p>Hi,<br><br>In QuickGraph - is there algorithm for find all parents (up to root vertex's) of a set of vertex's.&nbsp; In other words all vertex's which have somewhere under them (on the way to the leaf nodes) one or more of the vertexs input.&nbsp; So if the vertexs were Nodes, and the edges were a depends on relationship, find all nodes that would be impacted by a given set of nodes.<br><br>If not how hard is it to write one's own algorithms? &nbsp;<br><br></p>",
    "PostedDate": "2010-04-26T22:59:56.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441494",
    "ThreadId": "210644",
    "Html": "<p>What is structure of the graph, is it DAG?</p>\r\n<p>If so I would solve it in following way (lets say that your set of verices is V):</p>\r\n<p>1) change all edges direction so edge (v,w) -&gt; (w,v) we get graph G'</p>\r\n<p>2) perform BFS search with all nodes from V in algorithm queue</p>\r\n<p>Explenation: all vertices reachable from set V in graph G' are on some path w1..w2..wn..v so they can be defined as parent of set V.<br>You can use some quickgraph algorithms to help you. For instance instead of one BFS ( don't know if you can manipulate nodes queue<br>in different way then way by reflection) you can do one BFS for each v e V and add all vertices with BlackColor to set. After all iterations<br>your set will contain parent nodes.</p>\r\n<p>I hope it would be helpfull.</p>\r\n<p>Witek</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-11T07:01:57.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441986",
    "ThreadId": "210644",
    "Html": "<p>Its a Directed Graph Witek - <a href=\"http://quickgraph.codeplex.com/Thread/View.aspx?ThreadId=210639\">this thread</a> he gives an indicate in the sample code.&nbsp; So I'm not sure if it really would be a DAG in the sense that the following quote might not be true for my usage &quot;such that there is no way to start at some vertex <em>v</em> and follow a  sequence of edges that eventually loops back to <em>v</em> again&quot;.&nbsp;&nbsp; Would this impact the suggested solution here?</p>\r\n<p>re your step 1) would this be done in code manually then, or is there a quickgraph method for this?</p>\r\n<p>re 2) which algorithm is the BFS search - I don't see a Breadth First Search mentioned in the online doco here, oh but I see there is one in the code base</p>\r\n<p>I'll need to let you explanation sink in a bit longer&nbsp; :)&nbsp;&nbsp; thanks for responding&nbsp;</p>",
    "PostedDate": "2010-05-12T04:48:23.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]