[
  {
    "Id": "108178",
    "ThreadId": "32617",
    "Html": "Hello. <br>\r\n<br>\r\nI have vertices that represent some steps in a process. There are dependencies between those steps. Step may depend on several other steps and all these steps should be done before doing the step. That's why TopologicalSorting algorithm is useful for me. <br>\r\nBut I don't need to update vertices (steps) that are not in certain subgraph. If I sort all the graph topologically I can't skip redundant vertices. So how can I use QuickGraph for sorting the graph partially. May I somehow tell him where to start (from which vertex)?<br>\r\n<br>\r\nThank you.<br>\r\n<br>\r\nKindest regards, Gregory.<br>\r\n",
    "PostedDate": "2008-07-31T01:52:11.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "108195",
    "ThreadId": "32617",
    "Html": "Well, the only option to do this is to derive TopologicalSortAlgorithm from RootedAlgorithmBase and not from AlgorithmBase as today. In addition we must pass the RootVertex property value to the DFS algorithm (which is already derived from RootedAlgorithmBase). In addition we must provide some mehanism that will allow searching only in connected component (DFS will produce only one tree instead of forest). This must be done in the InternalCompute where Visit() method is invoked for each vertex.<br>\r\n<br>\r\nI may change the source. Is it useful for anyone?<br>\r\n",
    "PostedDate": "2008-07-31T03:31:36.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "108223",
    "ThreadId": "32617",
    "Html": "I've done all the changes to code and it works great. The code is so clear and understandable!<br>\r\n<br>\r\nEverything is working fine!<br>\r\n<br>\r\nIf somebody needs the feature, no problem. Write here and I'll get a notification to my email address.<br>\r\n<br>\r\nP.S. Naturally I don't talk to myself all the time :)<br>\r\n",
    "PostedDate": "2008-07-31T05:46:42.657-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113346",
    "ThreadId": "32617",
    "Html": "Glad to see to that you could figure it out yourself :)\r\n",
    "PostedDate": "2008-08-25T01:05:16.057-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "113683",
    "ThreadId": "32617",
    "Html": "Yeap :)<br>\r\n<br>\r\nNice code, pelikhan!<br>\r\n",
    "PostedDate": "2008-08-25T22:58:15.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]