[
  {
    "Id": "134710",
    "ThreadId": "40610",
    "Html": "Hi,<br>\r\n<br>\r\nI am new using QuickGraph utilites. I'm writing because i can`t find any document or web site with a reference of QuickGraph: classes and their utility, methods per class with their paramenters and purpose, examples, etc.<br>\r\n<br>\r\nIs there any reference or API about QuickGraph ?<br>\r\n<br>\r\nI'm sorry if my english is not good.<br>\r\n<br>\r\nThank you.<br>\r\nJavier Bravo.\r\n",
    "PostedDate": "2008-11-24T01:58:46.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134711",
    "ThreadId": "40610",
    "Html": "You can't find it because there isn't. You can find the documentation in this wiki or simply by looking at the source code (and the tests). What are you trying to do?<br>\r\n",
    "PostedDate": "2008-11-24T02:00:22.92-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134712",
    "ThreadId": "40610",
    "Html": "I am student of computing engineering and i am making a proyect about combinatorial optimization problems, uniobjective and biobjective problems. Therefor i am looking for free libraries for the data structure of the graph and i would like to know all the utilities of the libraries before to choose one.<br>\r\nAnyway i haven't found any better than this library at first glance<br>\r\n<br>\r\n\r\n",
    "PostedDate": "2008-11-24T02:12:35.713-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "134793",
    "ThreadId": "40610",
    "Html": "The wiki gives a partial list of the algorithm. Otherwise, your best way to explore quickgraph is to 'explore' through Reflector.\r\n",
    "PostedDate": "2008-11-24T08:02:29.037-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135442",
    "ThreadId": "40610",
    "Html": "I have found a .chm file with documentation about QuickGraph. If anybody is interested: <br>\r\n&nbsp;&nbsp;&nbsp; http://quickgraph.tigris.org/source/browse/quickgraph/trunk/src/<br>\r\n<br>\r\nI want to use QuickGraph only&nbsp; for data structure of graph. I need to representate directed and undirected graph, convert directed graph to undirected graph and vice versa, and save graph as Graphml file. What is the best way implement this? <br>\r\n<br>\r\nThank you.<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-11-26T01:44:38.127-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "135648",
    "ThreadId": "40610",
    "Html": "I've written a page on graphml serialization.<br>\r\n<br>\r\n<a href=\"http://www.codeplex.com/quickgraph/Wiki/View.aspx?title=GraphML Serialization\">http://www.codeplex.com/quickgraph/Wiki/View.aspx?title=GraphML%20Serialization</a><br>\r\n<br>\r\n&gt; I need to representate directed and undirected graph, convert directed graph to undirected graph and vice versa<br>\r\nWhat do you mean by convert? Do you have a particular example on why to use this?\r\n",
    "PostedDate": "2008-11-26T10:28:17.257-08:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  }
]