[
  {
    "Id": "186901",
    "ThreadId": "55348",
    "Html": "Hello,<br>\r\nI need to solve the following problem of drawing graphs.<br>\r\nThere are graph vertices from Q1 to Q8. Q1 is connected by an edge to Q3, Q2, Q6; Q3 is connected by an edge to Q5 and Q4; Q4 and Q5 are connected by an edge to Q8; Q2 is connected by an edge to Q8;Q6 is connected by an edge to Q7 and next with Q8. <br>\r\nFigure: <a href=\"http://img4.imageshack.us/my.php?image=exampleschema.jpg\"><img alt=\"Free Image Hosting at www.ImageShack.us\" src=\"http://img4.imageshack.us/img4/2015/exampleschema.th.jpg\" style=\"border-style:solid;border-width:0px\"></a><br>\r\n<br>\r\nThis is just demonstration structure. I need to build the graph that has one starting block and one ending block (e.g. like tree-structure) where vertices can have several in-edges and out-edges each. <br>\r\nI would like to know which algorithm is the best for that purpose and which is the most suitable for drawing vertices.&nbsp; The entire work is to be done in Silverlight 2.0 therefore a ready-made solution is out of the question.&nbsp; I would like to use some solution from QuickGraph library for Silverlight and implement some algorithms for drawing blocks by myself.<br>\r\nThanks in advance.<br>\r\n<br>\r\n",
    "PostedDate": "2009-05-05T05:08:22.577-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187033",
    "ThreadId": "55348",
    "Html": "I'm working on the implementation of an algorithm that will solve this problem. It will be available in 1-2 days as part of the <a href=\"http://graphsharp.codeplex.com\">Graph#</a> library. Once i finished that algorithm i will make a release. So stay tuned :)<br>\r\nBy the way I recommend for you the Sugiyama layout algorithm family...\r\n",
    "PostedDate": "2009-05-05T11:28:16.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "187632",
    "ThreadId": "55348",
    "Html": "Thanks for your answer. So, I will be waiting for a new version Graph#.<br>\r\n<br>\r\nNow, I will try to convert simple drawing of graph using Sugiyama layout algorithm from your wpf control to my Silverlight control. I have a little problem with transferring ResourceDictionary to SL because SL doesn’t support MultiBinding. I hope it's possible :)<br>\r\n<br>\r\nBest regards,<br>\r\nPrzemek<br>\r\n",
    "PostedDate": "2009-05-07T00:57:50.91-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190217",
    "ThreadId": "55348",
    "Html": "<p>I havent been able to find a Silverlight example.&nbsp; How do I visualize the graph using the QuickGraph.Silverlight dll.&nbsp; The Graph# example is in WPF.&nbsp; Can any one help me figure to how to display the graph in silverlight and intereact with the nodes and edges?</p>",
    "PostedDate": "2009-05-14T06:46:59.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190291",
    "ThreadId": "55348",
    "Html": "<p>Graph# questions should be asked in the Graph# discussion board ;)</p>",
    "PostedDate": "2009-05-14T08:40:04.77-07:00",
    "UserRole": "Owner",
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "291789",
    "ThreadId": "55348",
    "Html": "<p>Can anyone provide me a simple example of a graph in Silverlight?</p>\r\n<p>I really appreciate that help!</p>\r\n<p>Thanks</p>\r\n<p>daniela da cruz</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-02-17T10:11:28.007-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]